{"podcast_details": {"podcast_title": "The Players Channel", "episode_title": "Defoe & Deeney Football Firsts: Strike Partnerships", "episode_image": "http://ichef.bbci.co.uk/images/ic/3000x3000/p0g6p6dp.jpg", "episode_transcript": " This is the BBC. This podcast is supported by advertising outside the UK. Hey, it's Sheena Shea. And as you know, life can get crazy when it's all happening. But whether you're a mom like me or have a ton of work engagements also like me, everyone should have two minutes to spare so everyone can enjoy a factor meal, a delicious dietician approved meal that's fresh, never frozen and gets delivered right to your door. You can choose from calorie smart options, protein plus options and more. Visit factor meals dot com slash Shea fifty for fifty percent off your first order. Seventy two plus on the football daily podcast with Aaron Paul. Yes, the seventy two plus is back on the football daily podcast as we see the return of the new EFL football season. Join me and Joey McEnough. You get the tap on the shoulder, right? Go warm up. And I'm thinking, oh, come on, man, I think we're like three or four nil down at this point. And a host of guests every Friday afternoon as we turn the spotlight on the football league. Who did you sign? Jan Venegow of Hesselink. We couldn't get on the back of his shirt like this. Your chairman put letters up to four pound a letter, didn't he? Yeah, from the championship to League Two and the National Leagues will bring you the biggest names, the biggest interviews and the biggest stories across the football pyramid. Seventy two plus on the football daily podcast. Listen and subscribe on BBC Sounds. BBC Sounds music radio podcasts. It's the IEVITI. Whatever. I just love it. Don't worry. You'll play me next week. We have to try and get hold of him because he was just like he was a nightmare. The pain that came through. You got that? As a kid, you know, you do something and you get caught in your mum and then you get that feeling in your stomach, like, you know, like the nemesis. Yeah. Hi, I'm Troy Deedy. Hi, I'm Jermaine DeFoe. In this new podcast, we'll explore the football first that have shaped our career. And shaped who we are as people. You'll hear stories from the dressing room about legends of the game and the football first that propelled us into the Premier League. And to playing at the World Cup for England. And you can hear every episode of BBC Sounds. So let's go. Today's part is about partnerships. I actually would have got on if we were partners. I thought we'd have done well, you know. Yeah. Little and large. I think we'd have done well. We would have been interesting. I think you would have bullied a few defenders. I'd have run in behind, you'd have come to feet. Yeah. I think it would have worked. I think I'd look after you, you know. Do you think? Yeah, because you know obviously you're little, you're nippy. You're getting whacked about. I'm getting smashed about. Yeah, I think you need a big security. I think if I played with you, I'd have a lot more mouth. Probably. When I played with Crouchy. Not the same. Not the same. Crouchy just chilled and lanky and just chilled and that. When I played with Les Ferdinand, who was like the back end of his career. For some reason, I just felt like I could say anything to anyone. I was smashing people. So you know what? They smash about, Les will look after them anyway. So I think it would have been the same with you for sure. Would we have had a code word? Like what would have been in your, like the little get him without saying get him because the ref would have been on us. I don't know. There would definitely have been some code words. Having a coffee at half time or something like that. So you know what's happening. No one knows what's happening. Yeah. And then when I was like, I don't actually like coffee. And then you smash someone, get sent off on that. You score the winner and it'll be all good. Sorry bro. He's getting fined and I'm still playing, scoring goals. Because of me. So it was your first partnership then, which one would you say? Yeah, that was, I learned a lot of him and this was one that first one that worked. Yeah. So, so I had two because I came into football late. So I used to be a builder at it. So I came into football at 19. 19 when I came in. Wow. So, yeah. So when I came into it, first of all, it was Tommy Mooney, old school legend. I remember. Yeah. Old school legend. But do you know the hardest part about this? I'll tell you this story. So when I was at Warsaw, I wasn't really signed. I was kind of doing the trial thing. Yeah. And we had Wickham away. So they made me travel and the manager at the time, Richard Mooney said, write this report on that striker. Like basically, back in the day you used to have tests. Yeah, that's good. Are you watching do that? So I used to go watch, watch the other striker, Tommy Mooney. We had decided at this point. So I was 38. So I've got like, bear in mind, I'm 19, don't know nothing. So I'm going, runs in the channel well, slow, looks like he's carrying a bit of weight. Like I'm being just brutally honest. I'm thinking, there's no way this manager is going to hammer me after. Fast forward two months, we signed him. No way. First day in the office, he goes, come into the office. Yeah, no problem. I go in there, Tommy's already in there. I'm like, what's going on here? I've forgotten now. So he's like, Tommy's going to be your mentor. He said, but one thing we do have to get, can you just read this to Tommy? I put it on you like that. Yeah, and he just slid me this piece of paper that I wrote. No way. And I'm like, fat. Doesn't really run around. And Tommy's like, he's taking it in good jest, but he's like, oh, I'm fat. Let me show you how to do it then. And literally from that day, he's the person that if I miss a target, two push-ups, middle of session. That's brilliant. Stay out afterwards, do all of these different things. So he taught me how to be a professional because I'd never been in that environment. I'd never been in no academy system, no nothing. So I'm coming straight from Sunday league bricklaying to this. So he taught me how to be a pro and then Michael Ricketts. Oh, Michael, of course. Yeah, Ricko, he came in six months later. So I always say Tommy taught me how to be a professional. Ricko taught me how to be a footballer because Ricko's come from like England, Bolton, Middlesbrough, Leeds. But he was just done football. He was just like, why are you running so much? Yeah, with for the box. Yeah, he's a stay here. You're running here, there, everywhere. Just relax, do that. And then he played two touch with me, you know, the old school two touch. So flick in the ears, flick on the nose. Yeah, it'll ping at you and then you're doing that. Yeah, that's my point. Yeah, deal with it. So we used to play that, but for like five months, back to me on two touch and I lost every single day. Just touch good, yeah? His touch was lovely. Yeah, really nice. You know what he was? He was just lazy, I think. I think he'd say that now. He retired at 30. Yeah, that's true actually. So he went from being in England at 20 and retiring by 30 in a 10 year spell. So yes, he did that for five months, like lose, lose, lose. And then started winning and I won one game and I won two games. And he's like, you're here now. Do you know what I mean? And every time I used to just do little things, he'd be like, not that, don't do that. What about your first partnership? Who was your first one? Paolo Di Cano and Freddie Canuto was probably the first ones. I'll say Paolo Di Cano because I learned so much from Paolo. I remember I used to say to him, why is your kit so tight? Little things like that because I was just like, so curious, why is your kit so tight? Because everyone else had baggy kits, but all the kits were baggy, but he'd wear a kid's size. I'll tell you funny, sorry, after what he did as well, he was mad. So he'd say to me, so no one could pull my shirt. So simple, but I was like, wow, okay then. So even that was just like, wow. I remember playing the youth team and saying to Kit, man, I can have a small kit. Why? Because of Paolo's what I mean. So little things like that, but he was brilliant. I used to watch him in training, little possessions, tight possession, never give the ball away. So I was thinking, okay, that's the standard. Finishing was top, received the ball in anywhere, a lot of personality. But yeah, he was brilliant and he helped me a lot. I remember we played against Ipswich away. I was on a bench and then it was my first Premier League goal actually. I think he got a knock, so it was probably about, I don't know, five or six minutes to go. So I remember Paolo coming off and I went on. You know, normally he was captain. So normally he would take the armband off, give it to me and I'll give it to Trevor St. Clair, Joe Cole, Michael Catt, whoever it is. So he said he'd give it to my hand, he'd put it on me. So that's the sort of relationship I had with him. He was brilliant with me. I don't know why he did it. Maybe just to give me a little bit of confidence, like go and do your stuff. He put an armband on me, so I thought, I'm keeping it on. Do you know what I mean? I was young, do you know what I mean? So I kept it on. I remember obviously a long ball, one on one with the goalkeeper scored. And he came up to me after the game, like Italian, like kissing me and all that sort of well done, happy and all that sort of stuff. And I just think that's brilliant because for someone like that, a senior player, best player in the team to do that to a younger player, what does that do for a young player? So he was probably the one, the first one I thought, yeah, in terms of like senior level, the partnership, yeah. So he mentioned the story there, but you didn't say it. Yeah, yeah, yeah. He's in Italy anyway, so he won't get it. So anyway, I remember there was a pre-season game. You know, it's like when you're young and then you're involved in the first team, like you just sit in the corner, blah, blah, blah. Right, so poor Eddie, Eddie the Kitman, oh my God. So pre-season, it's just normal shirts. So a lot of it's not like your name, it's just normal shirts. What's in the change rooms? Palo's got like, it must've been like a medium. So he put the kit on, shout out to Harry, boss, it's too big. So the lads are like, he must be joking. No, no, no, don't play. At this point, everyone's like, we know what he's like. Like literally, he won't play. So it's like, no, no, no, he's going mad. Can't play, the shorts are too big. So the Kitman had to drive to a sports shop, right, to get like a small shorts and top and then came back and then he played. Otherwise he won't play. I remember sitting there, right, thinking, remember I was coming from the youth team. Like sitting there thinking, wow. Do you know what I mean? It was just mad, but that was just Palo. Everyone just knew what it was like and it was just like, okay, yeah, that's yeah. Harry just getting the kit. Do you know the mental part about that is, I think from, I've never experienced the youth team, but I remember being younger coming in. You just never dream of even kicking off or something could be blatantly wrong and you're like, I'll just figure a way out just to not say nothing. No excuses, just play. Yeah, just sit in the corner. Yeah, just play. Two left footed boots and be like, yeah, that's fine. That's how they normally look anyway. And you see a big first team player going, you know, the tape's not right or my socks are not fresh. And you're like, huh? But this is what I mean though, like to the point where like just because it's a pre-season game. All right, Eddie, man, the kit, what a guy. You must have fought. Wow. Who would be over the course of your career your favourite strike partner? I know you've got a lot to choose from. Yeah. Take him in. Do you know what, obviously. It's not going to be Josh King, I know that much. King, oh. Do you know what though? Do you know what equal play, how strong is he King? He's a monster, mate. Wow. King, yeah, King was top, Callum, Cal was brilliant as well, strong. But Mia, that's tough, obviously we mentioned Di Canio, then obviously Canute was brilliant. Les Ferdinand came back and leave his career. Tottenham, Robbie Keane, unbelievable. His movement, so clever. Berbatov. I would say Crouchy, because I think in terms of like numbers and the amount of goals that we scored together, we just had like an understanding. Was that worked on or just natural? I think it was just natural to be fair. Yeah. I mean, people think, you know, like, because he was so big and that would just go long and I could sort of like just gamble, but Crouchy had so much more to his game than just like flicking it on. Do you know what I mean? Sometimes, like the ball would go long and I know that he's just going to bring it down and just play me and then, like, he was just, he was so good, man. Deserves a lot more credit than he gets for sure. What about you? Ooh, I'd have to say Igala. Being him had so many arguments, bro, because he's so selfish, but in a good way. Outside of football, nicest man do anything for anyone. Out of football pitch, we could lose 8-1. If he scored the one, he's happy. Do you know what I mean? He's a proper goal scorer. So he was great, but we came into the Prem and I remember it was like, he's just come from like Grenada, played half a season in, a full season in the Champions League and now did well. And then it was like me and him, but we didn't start, we started the season 4-3-3, played away at Everton and it was me and then we were losing 2-1 and he kind of threw both of us on. And it kind of worked. And then you're like, oh, hard drop Troy, cause that's working. Let's throw it in. And it kind of, we stumbled across 4-4-2 in like 2014. Imagine, you didn't get a chance really. Yeah, just put us in and I remember sitting down at lunch, Chameleon was just chatting, just talking about life and whatever. And he went, they don't think we can do it. I was like, what you mean? He's like, they don't think we can play together or both of us can score. And I was like, well, I know I'm playing. So if you want to play, every time I jump for a header, you make sure you're inside of me. And that was the most we ever spoke about. Really? Like where to be, who to be. But the fact that he said that, it's almost like, let's show them. Yeah. I like that. And it was kind of like a challenge to be like, are you up for the challenge? Cause he was like, I want to play. They don't think I can do it. And then, yeah, so we used to have loads cause I'll never forget Man United away, but I had to, you know, you fly up there, you do whatever we're playing. And he's a Man United fan, like a proper fan. Yeah, he's a United fan, innit? I'm saying, he used to wear the t-shirt into training. Nah. One of them ones. Yeah. Like, you know, in his gear, like on a Thursday, he's got like a United hoodie and that. Yeah, like an old school United top. You're kind of bad. So it's like his first game at United, Old Trafford, he's took about 4 million pictures before the game. He's FaceTiming everyone back on. And I'm like, I've got a game now. Yeah. Like, patted up, like, sorted yourself out. You're playing against him today, by the way. Yeah. It was a midweek. So anyway, we're playing, bro. You know, captain Etienne Capre. Yeah, yeah, yeah. Etienne's like the best first half I've ever seen him have. He put Iggy in four times. Yeah. Twice he's hit the side of the net in. The third one, it's like, he's just got to square it and I'm tapping it in. Because we're both in, we're both hitting the offside track. That's the worst, you know. Yeah. And all he's got to do is square it. Yeah, that's the worst. And you know the one, if he squares it, I score. He shoots, but he half passes it, half shoots, like he doesn't do either. Yeah, yeah. And the hair just like, it just rolls to him. And when I say this guy would not look at me for the next hour, because... Because he knows. Oh, and he knows you're raging. Like a pit bull, though. I'm foaming at the mouth. Yeah, yeah, yeah. Caps is behind him. Hey, first ball, we've got to win. Yeah, exactly. We lose the game, 1-0. Matta scores a free kick in the 98th minute. What did you say to him after? Well, they had to keep me out of the dressing room. And on the, you know, they fly back. Yeah. I drove back. So I was like, me and him on the plane. Nah, man. But it's not even about the not passing it. It's about we lost the game. So to me, it was more important that we should have won. And what better chance do you get? At Old Trafford, under the lights, it's raining. You know, them days, it's perfect. Because you know, all forwards are selfish, you know. Oh, of course we are. We're all selfish. But you know, sometimes like the boys always joking and stuff like that. Like we'd watch football and the boys would be like, oh, Jamie, you're not passing it. But sometimes I feel like, you know, when you feel like you have to pass. Yeah. Because if I'm the goalkeeper and then you're there, even if I think, you know, I'll score. But if I pass you, it's just empty net. Yeah. It's a hundred percent goal. And it's one of those ones, you know, as a player, if you're not passing someone, you know, you look at it and you think, oh, do you know what I mean? And on the other side for you, when it's me and that, I just think, come on, man. Yeah, of course. And you're fuming. I'm like, yeah, I'm proper like, ready. So they've not let me go in the changing room. They've said like, he's got a shower and whatever, gone out. I have now gone from there to the bus, grab my stuff off. And he looked at me and he went, I'm just don't speak, bro. I'll see you tomorrow. And I literally got in a car, got a taxi from Manchester to Watford. Nah. And they flew back and I got a taxi back on my own. Stiff like that in a car. I was raging. You didn't do it again though, did you? No, we didn't speak for two days. And the gaffer had to do a meeting. No, really? Yeah, Sanchez Flores did a meeting, like a debrief, everyone would do. He did a debrief with me and him. He's sitting there yourself. No, bro, he sat right in the middle like this. He sat in the middle and went, right, we're going to just nip this in the bud now. Troy, you're going to be quiet. Iggy, you're going to talk us through what you was thinking. Yeah, go on. And he showed every single chance because he had like eight shots in the game. Because he's missed that one in the second half now, he's shooting from 30 yards. That's what the score is, obviously. And he just went, he said, this one, I saw Troy. And to be fair, this was done for me because I saw Troy, it's Man United, I just wanted to score. And I went, now I get it. Because when I can understand someone, I get it. But if you just went, I saw him and I thought I'd do better, now we've got a problem. But he was just like, it's Man United, this is like, I come from Nigeria, this is unattainable for me. And I was just like, do you know what? I was bang out of order, the shotguns, he was cracked on. He ended up getting 17 goals, I got 14. That's what's needed sometimes, isn't it? Why don't you understand it? This is January as well, mid-season, so this could have blew our whole thing up. But thankfully, KK was smart enough to have a little chat and go, Troy, settle. I like that. In terms of yourself, have you ever played with somebody you've never gotten on with? I don't think you necessarily have to get on with all the players that you play with. Because you talk about partnerships, but at the end of the day, it's like, the one needs to be best friends with, I don't know, the left winger or the goalkeeper. I've played at clubs before, like for instance, at Sunderland, Vito Maloney, the goalkeeper, best mate. Like, all the other boys, would they come to my house after training? No. Vito, yeah, or he'll phone me, do you want to go for dinner and stuff like that? And it was strange, like goalkeeper and the centre forward and that. But I don't feel like you have to be best friends, but the fact of the matter is, we're all playing for three points and that's it. I used to say, I think most of the people I've played with don't like me, but they respect the hell out of me. Do you get what I mean? Because I'm so on you all the time and, oh, you better do more. Also at the same time, well done when you do well, but I wouldn't like me. Do you get what I mean? If I was playing with me, I'd be like, God, he's intense. It's like Roy Keane. If you speak to all the players that play with Roy Keane, you said to him, did you like him? Would you invite him out for dinner? I can imagine a lot of people be like, no, but you know what? Respect him because he's a winner. And people like that, like you on my team, I want to play with you because you want to win and you're like me. It's just driving standards, that mentality. The nicest thing I've heard recently is Ben Foster did his podcast and he said, he was your best captain and they were like, he said, obviously I was at United with Keane and they said, but Troy, you go to war with Troy. Exactly. And I was like, again, ain't spoke to Fuzzy in a little while, but it's like, oh, right, that's what it means to me. Just somebody else, a big pro like that to turn around and go, Troy, because I used to do this thing, everyone thinks it's me and it's always the scream and shout, but if we're in the dressing room and I know you've got that little group hanging around with you and they think you're the man, I'm coming for you, bro. Yeah, little clicks. Yeah, I'm coming for you and also on the flip side, if that section, I don't know, your five lads who I grab, you do well, I'll be like, you tell them, did well. In front of everyone though, so let you do it, go on, enhance it. Yeah, exactly. Them five will follow you and my six will follow me. Because you know the dressing room isn't, everyone thinks the dressing room is 25 lads that are all holding hands and we all get on. It's like, it's not that at all. You do get little clicks. You've got to be careful when you get the clicks and that, but you do get, it's normal. Every club I've been at, you're always like coming after training, boys are sitting there all on their phones and then you get like little clicks over there that would always wait for each other and go for lunch. You normally get the single group. Yeah, they'll come in on a Monday morning, they've got all the stories over there. So you'd always have that. But as long as you keep the standards and when you train, you train properly and that and you're all together and when you play, then... It normally works, innit? Yeah, it normally works, but you're going to get that in different relationships and stuff like that. You always get that. Do you know what, if you talk about strike partners and not like people, I wouldn't necessarily call him a strike partner. To me, he'd be an enemy. I don't know about for you, but... Oh my God, I don't know what you're going to say. And you feel when David Nude... I knew he was going to say this....discovered and nicked your goal against Andorra. Thanks, bro. I actually forgot about that as well. I've got stories for days, I forgot about that one. Do you know what? That was mad, you know? But then, you know the funny thing about it, I thought after... I thought, do you know what? Would I have done that? Yeah, yeah, yeah. And... Was that his first goal? It was his first goal. And his first game? And I could sort of like... His first game, so I can sort of understand it. The way it happened, it was weird though, because this is typical me. So anyway, so I've gone through, hit the shot, and it's sort of like going over the line. He just come from nowhere and kicked it in. I thought, wow. Like, it was going in. Yeah, yeah, yeah. So anyway, so he's run off celebrating. So I remember sending to the goalkeeper, their goalkeeper by the way, I said, ah, is it over the line? He said, yeah, yeah, yeah. So I called, no problem, my goal. But I'm fuming. Yeah, yeah, yeah. So I thought, what's he doing that for? Like, do you know what I mean? I made this run, stayed onside, hit the shot, it's gone in. He's just like... Anyway, so the boys, they know I love goals and all that sort of stuff. They're winding me up as you can imagine, the changing, blah, blah, blah, blah. I knew just that call. He's laughing about it, but I'm raging. And got on the bus, Wright is calling me. So at this point, I've probably calmed down a little bit. Wright is calling me. Wind me up even more. You know what he's like on the phone, screaming on the phone? No, I can't believe it. What's he doing? So all this, Wright is going mad on the phone. So at this point, I've come off the phone, my mom's called me. So I'm fuming. Don't want to speak to anyone. And then I just thought, actually, you know what? I wouldn't do that. Because it's like, you understand your first game and all that sort of stuff and that. But you're playing more, you probably get more caps anyway. Yeah, yeah, yeah. Do you know what I mean? And that, but it was, yeah, it was mad. But the banner after that, man, even when I got back to Spurs and that, and the boys were just like, what's in the changing? Everyone's laughing and I was like, JD, how you get it? Like it was mad. Do you know like traveling? Do you ever have to share rooms with anyone? Ah, roommates. I remember England are 21s. Obviously we shared rooms. I remember Jermaine Pennant was my roommate. Jermaine Pennant. Where do I start? What a guy. What a player by the way. It's an old episode, yeah. He's a great player. That episode will come at midnight as well. But Pennant, he was like, what a player. But he was just so funny. So much energy and that. And I remember we shared rooms there. It was good to be fair. We had fun and stuff, but at Spurs, I think pre-season we'd always share, I'd be with Ledley. Ledley was just chilled. So chilled. Loved his music. Really reserved. How good could have he actually been if he wasn't injured? The best. Cause my, my overriding memory of him is England, France, where the man, Mark Zidane, and he had to come off and Zidane scores. And Tieri, after the game, Tieri said, one of the best I played against. Oh yeah. And you know what's funny, right? Right about that time, I remember speaking to Led's, I think, Madrid and Barcelona was sniffing around him at that time. Oh wow. But he sort of like just made a joke about it. He was like, Jay, you know Led's had bad knees, right? So to have the career that he had was just unbelievable. And he just said to me like, can you imagine me trying to go for a medical there? He just laughed it off. And I thought that was just typical of Ledley, but what a player. Like he just had everything. And like I said before, Tieri was just chilled, but he just had presence. He could run, he was quick, he could do everything. Special player, special. Just unfortunate that he had injuries. Did you share a room with anyone? Cause I know it's weird though, cause a lot of players, I think this thing where players be like, no, I don't want to share a room with anyone. Cause obviously everyone prepares different. You might go bed midnight night for a game or I might go bed at nine o'clock. I've got kids bro, so whenever I go away, it's like, this is an opportunity to get a full eight hours sleep. So you never shared a room with anyone? Never. Not even from like Warsaw days, just to pay the extra. Yeah. And even at Birmingham now, I still pay the extra. Is it? Yeah. I can't share. I probably snore myself and that, but I can't be around someone that snores. When I get in my room, I set it out how I need it. So I get my wash bag out, I get all my room set. Really? Love that. I've got everything, it's where it needs to be in it. I've got another bloke in there just like throwing stuff around and that. And yeah, he wants to watch a movie or I'm watching the movie, he wants to sleep. Yeah. It's just weird. And then also, if you go to the toilet, I've always got to be wary. That's what I'm saying. I'm not really on sharing the bathroom. What about on the bus? Do you sit there with someone who's the same person? I always try to be in the mix on the bus. So when I was at Watford, we used to play a little golf game, stick man golf. I've never heard of that one. Yeah. I know it's by Uno. Yeah, it's like a one pound game, but it was like 80 years complete at the same time. Just mini golf basically. We used to play that before the game. We used to have a bit like Ben Foster, Tom Cleverley, Craig Kafka. Tom Cleverley, what a guy. Clever's is the guy. Yeah, yeah. So we used to have a laugh. You know what it's like, and I feel what people don't understand. You know, football is so stressful and everyone goes, you just play football. But it's so stressful at the amount of pressures and all of that. And that little 10, 15 minutes, because we used to set the golf for home games at Watford. So we just go from the golf and it takes like 10, 15 minutes to get around. We just played that 15 minutes, light music card. It's a little switch off, isn't it? Switch off, yeah. And then just have a bad time about that. And then as soon as it's like we've pulled up, it's like, right, work time. Yeah, that's it. Do you know what I mean? That's when everyone puts their headphones in, gets some wash but I go. And it's like just that 15 minutes of like solitude and everyone can just chill. It's like, yeah, we know what we're going into and we know what we've just done all week to be ready for this. Yeah. Let's just relax, man. I think you need that. Do you know who said that as well? Interesting you said that. Michael Jordan said that, didn't he? He said he'll come in the change rooms and he'll say, just have a laugh with everyone. Mess about with the kit man, he'll mess about with the boys. He said the reason why he has to do that is to try and take the mind off the game. Just for a little bit, even if it's for 10, 15 minutes, take the mind off the game for a bit, just mess about, get people relaxed. And when it's ready to go, warm up, we're going. Do you know one thing that's completely off subject, but do you know one thing I hate and I've never done? Know the tunnel. I can't stand the player that screams, no, just before you go out. Come on, let's go. It's like, we've been here for an hour and a half. And you know what happens a lot too much. Do you know what? It's funny you say that going back, I left Charlton and I signed for West Ham. Now I was in the youth team at the time. Danny Shih Tzu, the fridge, the fridge, right? Yeah. Big all the time though. It's that AJ, right? So I'm at West Ham at this point in the youth team, went back to Charlton. Someone had been in the tunnel and that it wasn't even a tunnel to be fair. It was like the, I think it was Spray was laying training ground. I remember coming out and then Danny Shih Tzu, he looked at me. So I thought, wow. The look here, he's obviously, the look is like, well, you left us to go there. You're getting it today. Mate, the intimidation. You know what it's like in the tunnel, stuff like that. And that was probably the first, because obviously I was at Lily Shaw and that, and then that was the first time I was sort of exposed to that sort of thing. He was like a man. Do you know what I mean? I remember thinking, wow, he used to like, obviously you know him better than me. I was going on with Danny because he went to Millwall. So obviously as you know, Millwall, a timid place anyway. And like, I was at Watford. He used to have this little saying like, yep, they're going into hell. They don't know it. They're going, lads. They're going. And he's like, yep, let's go. And I remember telling him, daddy, shut up. Shut up. You're getting it next. And it weren't for like anything, but I had young lads. I was like 24 at the time. I had young 17, 18 year olds in the team. Yeah, yeah, yeah. And like, you know, when they're going, what's that Millwall anyway? You know, it's like everyone's saying, be ready for what's coming. Yeah, yeah, yeah. It's intimidating the noise. You got this six foot four black fellow who's built like an American fridge. Yeah. Just screaming. I was like, as captain, I've got to show some of my backing. Yeah, yeah, you have to. Sure, wait till I get you out. Not a Roy Kimo, but wait till I get you out there. You won't be talking. Yeah, exactly. And it's the only time I've waked somebody and cheered myself. Shoulder to shoulder. Wasted. Yeah, put him down. Nearly ripped my hand off the bone by the way. But put him down. And I was like, Dan, is this true? Is this true? Clarify, I've got pictures. You know I've got pictures. Bro, please message me on Instagram. You got to tell me. I've got pictures and I can do it. But yeah, Danny Sheeran is the biggest man I've ever met. That's it for today's Football First with Troy Deany and Jermaine Defoe. You can catch all the episodes on BBC Sounds. Hey, it's Gina Shea. And if you know me, you know it's all happening from Vanderpump Rules and my podcast, Genanigans to my full time job being summer's mommy. There's always something keeping me busy. And that's why I love Factor. They send fresh, never frozen meals right to my doorstep. They're packed with flavor, dietitian approved, and make it easy to stay on track with my goals. Delicious and ready to eat in literally two minutes. I mean, seriously. Visit factor meals dot com slash Shea 50 for 50 percent off your first order."}, "podcast_summary": "In this podcast episode, Troy Deeney and Jermaine Defoe discuss their partnerships with various strike partners throughout their careers. They share stories of their first partnerships and the lessons they learned from their more experienced teammates. They also talk about the importance of understanding each other's playing styles and forming a connection on and off the pitch. Troy Deeney mentions his partnership with Odion Ighalo and how they had disagreements on the pitch, but respected each other's abilities. Jermaine Defoe talks about his early partnership with Paolo Di Canio and how much he learned from him. They also share funny stories, like Defoe's first goal for England where David Nugent stole it from him, and Deeney's experience of sharing a room with Ledley King. Overall, the episode highlights the importance of partnerships and the understanding required to form a successful strike duo in football.", "podcast_guest": {"name": "Tommy Mooney"}, "podcast_highlights": "Highlights from the podcast episode with Troy Deeney and Jermaine Defoe:\n\n- Jermaine Defoe: \"When I played with Les Ferdinand, for some reason, I just felt like I could say anything to anyone.\"\n- Troy Deeney: \"Tommy Mooney taught me how to be a professional. Michael Ricketts taught me how to be a footballer.\"\n- Jermaine Defoe: \"Paolo Di Canio taught me so much. I used to say to him, 'Why is your kit so tight?'\"\n- Jermaine Defoe: \"Crouchy just chilled and lanky and just chilled and that.\"\n- Troy Deeney: \"My favorite strike partner would be Igala. We had so many arguments, but in a good way.\""}